_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 80)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 120)               9720      
_________________________________________________________________
dense_2 (Dense)              (None, 120)               14520     
_________________________________________________________________
dense_3 (Dense)              (None, 50)                6050      
_________________________________________________________________
dense_4 (Dense)              (None, 40)                2040      
_________________________________________________________________
dense_5 (Dense)              (None, 20)                820       
_________________________________________________________________
dense_6 (Dense)              (None, 10)                210       
_________________________________________________________________
dense_7 (Dense)              (None, 3)                 33        
=================================================================
Total params: 33,393
Trainable params: 33,393
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 40, 2)             0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 38, 8)             56        
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 36, 8)             200       
_________________________________________________________________
gru_1 (GRU)                  (None, 36, 8)             408       
_________________________________________________________________
gru_2 (GRU)                  (None, 8)                 408       
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 72        
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 27        
=================================================================
Total params: 1,243
Trainable params: 1,243
Non-trainable params: 0
_________________________________________________________________
